//指针：
//内存
//32位 - 32跟地址线 - 物理线 - 通电 - 1/0
//64位
//--------------------------------------------
//电信号转化成数字信号：1和0组成的二进制序列
//000000000000000000000000   0 
//......
//011111111111111111111111
//100000000000000000000000
//......
//111111111111111111111111 2^32
//2的32次方个内存单元
//Bit
//Byte
//Kb
//MB
//GB
//TB
//PB
//...
// bit / 8 = Byte
// Byte / 1024 = KB
// KB /1024 = MB
//...

//char -1 byte = 8bit -8个地址
//最终：一个内存单元是一个字节，然后分配地址

#include <stdio.h>

int main()
{
	int a = 10;//a在内存中需分配空间 - 4个字节
	printf("%p\n", &a);// %p 专门打印地址
	int * pa = &a;//pa是用来存放地址的，在C语言中叫指针变量
	//*说明 pa是指针变量
	//int 说明pa执行的对象是int类型的

	char ch = 'w';
	char * pc = &ch;

	return 0;

}

